## Exercise 2: NumPy array Indexing/Slicing
##### Implementação das funções dropna(), fillna() and remove_by_index() na classe Dataset

In [1]:
import numpy as np
from si.data.dataset import Dataset

 # Example dataset
X = np.array([[89, 25, 45], [90, 110, np.nan], [52, np.nan, 32], [10, 96, 88]])
y = np.array([0, 1, 2, 3])

dataset = Dataset(X, y)

In [2]:
dataset.to_dataframe()

   feat_0  feat_1  feat_2  y
0    89.0    25.0    45.0  0
1    90.0   110.0     NaN  1
2    52.0     NaN    32.0  2
3    10.0    96.0    88.0  3

In [3]:
# Use of .dropna() function to reveal dataset with the rows with NaN values removed
dataset.dropna().to_dataframe()

   feat_0  feat_1  feat_2  y
0    89.0    25.0    45.0  0
1    10.0    96.0    88.0  3

In [4]:
#fillna()

X = np.array([[89, 25, 45], [90, 110, np.nan], [52, np.nan, 32], [10, 96, 88]])
y = np.array([0, 1, 2, 3])

dataset = Dataset(X, y)

In [5]:
print(dataset.fillna().to_dataframe())

   feat_0  feat_1  feat_2  y
0    89.0    25.0    45.0  0
1    90.0   110.0    55.0  1
2    52.0    77.0    32.0  2
3    10.0    96.0    88.0  3

In [ ]:
print(dataset.fillna(value='mean').to_dataframe())

   feat_0  feat_1  feat_2  y
0    89.0    25.0    45.0  0
1    90.0   110.0    55.0  1
2    52.0    77.0    32.0  2
3    10.0    96.0    88.0  3

In [8]:
print(dataset.fillna(value='median').to_dataframe())

   feat_0  feat_1  feat_2  y
0    89.0    25.0    45.0  0
1    90.0   110.0    55.0  1
2    52.0    77.0    32.0  2
3    10.0    96.0    88.0  3

In [9]:
print(dataset.fillna(value=50.5).to_dataframe())

   feat_0  feat_1  feat_2  y
0    89.0    25.0    45.0  0
1    90.0   110.0    55.0  1
2    52.0    77.0    32.0  2
3    10.0    96.0    88.0  3